#пользовтель вводит координаты центра оркужностии
#и радиус окружности. Затем координаты центра 2 окружности
#и радиус 2 окружности
#Программа должна сказать, имеют ли окружности общие точки

coord_1 = int(input('Введите координаты центра первой окружности: '))
coord_2 = int(input('Введите координаты центра первой окружности: '))
radius1 = int(input('Введите радиус первой окружности: '))

coord1 = int(input('Введите координаты центра второй окружности: '))
coord2 = int(input('Введите координаты центра второй окружности: '))
radius2 = int(input('Введите радиус второй окружности: '))



if